# Data Cleasing Operation

## Adding new columns

### import required packages

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### load the data

In [6]:
df = pd.DataFrame([
    {"name": "person1", "age": 20, "salary": 25},
    {"name": "person2", "age": 21, "salary": 26},
    {"name": "person3", "age": 22, "salary": 28},
    {"name": "person4", "age": 23, "salary": 30},
    {"name": "person5", "age": 24, "salary": 35},
    {"name": "person6", "age": 25, "salary": 40}
])
df

      name  age  salary
0  person1   20      25
1  person2   21      26
2  person3   22      28
3  person4   23      30
4  person5   24      35
5  person6   25      40

### EDA

In [3]:
df.columns

Index(['name', 'age', 'salary'], dtype='object')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   salary  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [5]:
df.describe()

             age     salary
count   6.000000   6.000000
mean   22.500000  30.666667
std     1.870829   5.785038
min    20.000000  25.000000
25%    21.250000  26.500000
50%    22.500000  29.000000
75%    23.750000  33.750000
max    25.000000  40.000000

### Pre-processing

In [9]:
# these are broadcast operations

# add a new column with constant value
df['dummy'] = 100

# add a column named bonus
df['bonus'] = df['salary'] * 0.10

# add a column named total_salary
df['total_salary'] = df['salary'] + df['bonus']

In [10]:
df.head()

      name  age  salary  bonus  total_salary  dummy
0  person1   20      25    2.5          27.5    100
1  person2   21      26    2.6          28.6    100
2  person3   22      28    2.8          30.8    100
3  person4   23      30    3.0          33.0    100
4  person5   24      35    3.5          38.5    100